#Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов.
# Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое
# количество журавликов,а Катя сделала в два раза больше журавликов,чем Петя и Сережа вместе?

S = int(input("Введите общее количество журавликов: "))
if not S % 6:
     x = S // 6
     K = int((a / 3) * 2)
     P = int((k / 2) / 2)
     S = int(p)
     print(P, K, S)
